 clc 
 clear
digits(5);
 syms s t...
% c_1 c_2 c_3 k_1 k_2 k_3  ...
%     r v t L x_0 x_0_dot
c_1=500000*2; c_2=500000*2; c_3=500000; k_1=5000000*2; k_2=5000000*2; k_3=5000000;
%l_1是前阻尼器到质心距离。l_2是后阻尼器到质心的距离。
 l_1=1.15; l_2=0.83; l_3=0.36;
 
 % g重力加速度，A杆横截面积。
 g=9.8;A=0.002;
 
 % Ld小车两轮距离, L是杆末端到旋转中心的距离。
 Ld=2; L=2.12;
 
 %密度
rou=7801;

%杨氏模量，第二面积矩
E=2.07*10^(11);
Iz=66666.67*10^(-12);

m=1500; I=2300; J=1/3*rou*A*(L^3+l_3^3); 

%M矩阵
M31=1/2*rou*A*(L^2-l_3^2);
M34=-11/40*L^2*rou*A;
M41=-3/8*L*rou*A; M43=-11/40*L^2*rou*A; M44=33/140*L*rou*A;

M=[m   0  0    0;
   0   I  0    0;
   M31 0  J    M34;
   M41 0  M43  M44];


%C矩阵
c11=c_1+c_2;         c12=c_1*l_1-c_2*l_2;                     c13=0 ;
c21=c_1*l_1-c_2*l_2; c22=c_1*l_1^2 + c_2*l_2^2 + c_3*l_3^2;   c23=-c_3*l_3^2;
c31=0;               c32=-c_3*l_3^2;                          c33=c_3*l_3^2;
C=[c11 c12 c13 0;
   c21 c22 c23 0;
     0 c32 c33 0;
     0 0   0   0];
 
%K矩阵

k11=k_1+k_2;         k12=k_1*l_1-k_2*l_2;                 k13=0;
k21=k_1*l_1-k_2*l_2; k22=k_1*l_1^2+k_2*l_2^2+k_3*l_3^2;   k23=-k_3*l_3^2;
k31=0;               k32=-k_3*l_3^2;                      k33=k_3*l_3^2;
                                                          k44=E*Iz*3/L^3;
K=[k11 k12 k13 0  ;
   k21 k22 k23 0  ;
   k31 k32 k33 0  ;
   0   0   0   k44];

%Q矩阵


v_x=2*pi;

q1=0.02*cos(10*v_x*t);
q2=0.02*cos(10*v_x*t-Ld);
q1_dot=diff(q1,t);
q2_dot=diff(q2,t);

r=47/67;

z1=r*q1;
z2=r*q2;
z1_dot=r*q1_dot;
z2_dot=r*q2_dot;


Q=[k_1*z1 + c_1*z1_dot + k_2*z2 + c_2*z2_dot;
    c_1*l_1*z1_dot-c_2*l_2*z2_dot+k_1*l_1*z1-k_2*l_2*z2;
    -rou*A*g/2*(L^2-l_3^2);
    3/8*rou*A*g*L];

%Q的拉普拉斯变换
L_Q=laplace(Q,t,s);

%初始条件
x_0=0;x_0_dot=0;


%X的拉普拉斯变换后化简后的式子。
LX=(M*s^2+C*s+K)^(-1)*(L_Q +M*x_0*s +M*x_0_dot+C*x_0);


 ILx=ilaplace(LX,s,t);

y=vpa(ILx,5)

ygan=y(1,1)+L*y(3,1)-y(4,1);
  ysoln = simplify(ygan)
fsurf(ysoln, [0, 50])
vpa(subs(ysoln,[t],[5]))
